In [2]:
import csv # for csv files
header = ['Sno','Name', 'Rollno','Age', 'City','country','Gender','Marks','Grade','Remarks']    

rows = [
    ['1', 'Amit', '101', '32', 'Ambala', 'India', 'Male', '85', 'A', 'Good'],
    ['2', 'Dev', '102', '31', 'Patna', 'India', 'Male', '78', 'B+', 'Average'],
    ['3', 'Sonal', '103', '3528', 'Dehradun','India','Female','92','A+','Excellent'],
    ['4', 'Riya', '104', '29', 'Mumbai','India','Female','88','A','Very Good'],
    ['5', 'Karan', '105', '30', 'Chennai','India','Male','76','B','Average'],
    ['6', 'Neha', '106', '28', 'Kolkata','India','Female','95','A+','Excellent'],
    ['7', 'Vikram', '107', '33', 'Bangalore','India','Male','80','B+','Good'],
    ['8', 'Pooja', '108', '27', 'Hyderabad','India','Female','89','A','Very Good'],
    ['9', 'Aakash', '109', '34', 'Pune','India','Male','73','B','Average'],
    ['10', 'Sneha', '110', '26', 'Jaipur','India','Female','91','A+','Excellent']
       ]
header
rows

[['1', 'Amit', '101', '32', 'Ambala', 'India', 'Male', '85', 'A', 'Good'],
 ['2', 'Dev', '102', '31', 'Patna', 'India', 'Male', '78', 'B+', 'Average'],
 ['3',
  'Sonal',
  '103',
  '3528',
  'Dehradun',
  'India',
  'Female',
  '92',
  'A+',
  'Excellent'],
 ['4',
  'Riya',
  '104',
  '29',
  'Mumbai',
  'India',
  'Female',
  '88',
  'A',
  'Very Good'],
 ['5', 'Karan', '105', '30', 'Chennai', 'India', 'Male', '76', 'B', 'Average'],
 ['6',
  'Neha',
  '106',
  '28',
  'Kolkata',
  'India',
  'Female',
  '95',
  'A+',
  'Excellent'],
 ['7',
  'Vikram',
  '107',
  '33',
  'Bangalore',
  'India',
  'Male',
  '80',
  'B+',
  'Good'],
 ['8',
  'Pooja',
  '108',
  '27',
  'Hyderabad',
  'India',
  'Female',
  '89',
  'A',
  'Very Good'],
 ['9', 'Aakash', '109', '34', 'Pune', 'India', 'Male', '73', 'B', 'Average'],
 ['10',
  'Sneha',
  '110',
  '26',
  'Jaipur',
  'India',
  'Female',
  '91',
  'A+',
  'Excellent']]

In [3]:
# Create a csv file
with open('person.csv', mode='w', newline='') as file:
    writer = csv.writer(file)
    writer.writerow(header)  # Write the header
    writer.writerows(rows)   # Write the data rows
print("CSV created successfully.")

CSV created successfully.

In [1]:
import json
data=[{"Name":"Gagan","Age":22,"City":"Patna"},
      {"Name":"Amit","Age":32,"City":"Ambala"},
      {"Name":"Dev","Age":31,"City":"Patna"}]

In [2]:
with open('student.json', mode='w') as file:
    json.dump(data, file, indent=4)
print("JSON created successfully.")

JSON created successfully.

In [3]:
import sqlite3 as sql

In [4]:
connection=sql.connect('demo.db')
cursor=connection.cursor()

NameError: name 'sql' is not defined

In [6]:
cursor.execute('''
    Create table student (
    id INTEGER PRIMARY KEY, 
    name TEXT not null, 
    age INTEGER
);''')

In [7]:
connection.commit()
print("Table created successfully.")

Table created successfully.

In [3]:
cursor.execute("insert into student (id,name, age) values (1, 'Gagan', 22)")
cursor.execute("insert into student (id,name, age) values (2, 'Amit', 32)")
cursor.execute("insert into student (id,name, age) values (3, 'Dev', 31)")

NameError: name 'cursor' is not defined

In [1]:
cursor.execute("select * from student;")
results=cursor.fetchall()
for row in results:
    print(row)

NameError: name 'cursor' is not defined

In [14]:
connection.commit()
print("Table created successfully.")

Table created successfully.

In [15]:
import pandas as pd
df=pd.DataFrame(results)
df

   0      1   2
0  1  Gagan  22

In [16]:
connection.close()

In [6]:
import sqlite3 as sql
connection=sql.connect('demo.db')
cursor=connection.cursor()

In [17]:

cursor.execute("insert into student (id,name, age) values (6, 'Amit', 32)")
cursor.execute("insert into student (id,name, age) values (7, 'Dev', 31)")
cursor.execute("insert into student (id,name, age) values (9, 'Sonal', 28)")

In [22]:
cursor.execute("select * from student;")

In [23]:
results=cursor.fetchall()   
for row in results:
    print(row)

(1, 'Gagan', 22)
(2, 'Amit', 32)
(3, 'Dev', 31)
(6, 'Amit', 32)
(7, 'Dev', 31)
(9, 'Sonal', 28)

In [24]:
connection.commit()

In [25]:
import pandas as pd
df=pd.DataFrame(results)
df

   0      1   2
0  1  Gagan  22
1  2   Amit  32
2  3    Dev  31
3  6   Amit  32
4  7    Dev  31
5  9  Sonal  28